giljr/Ardu_Serie/_37_Osa/_37_code/code/osa/port/pic24/osa_pic24_mplabc.h
/*
 ************************************************************************************************
 *
 *  OSA cooperative RTOS for microcontrollers PIC, AVR and STM8
 *
 *  OSA is distributed under BSD license (see license.txt)
 *
 *  URL:            http://wiki.pic24.ru/doku.php/en/osa/ref/intro
 *
 *----------------------------------------------------------------------------------------------
 *
 *  File:           osa_pic24_mplabc.h
 *
 *  Compilers:      Mplab C30
 *
 *  Programmer:     Timofeev Victor
 *                  osa@pic24.ru, testerplus@mail.ru
 *
 *  Description:    MplabC30 specific definition
 *                  This file directly included in osa.h
 *
 *  History:        13.09.2010 -    File updated
 *
 ************************************************************************************************
 */


#ifndef __OSAMCC30_H__
#define __OSAMCC30_H__



#if   defined(__PIC24F__)

    #include <p24Fxxxx.h>
    #define __OSA_PIC24__
    #define __OSA_PIC24F__

#elif defined(__PIC24FK__)

    #include <p24Fxxxx.h>
    #define __OSA_PIC24__
    #define __OSA_PIC24FK__

#elif defined(__PIC24H__)

    #define __OSA_PIC24__
    #define __OSA_PIC24H__
    #include <p24Hxxxx.h>

#elif defined(__dsPIC30F__)

    #include <p30Fxxxx.h>
    #define __OSA_DSPIC30__
    #define __OSA_DSPIC__

#elif defined(__dsPIC33F__)

    #include <p33Fxxxx.h>
    #define __OSA_DSPIC33__
    #define __OSA_DSPIC__

#else
#warning "WARNING! PIC type not defined!"
#endif




/************************************************************************************************
 *                                                                                              *
 *     Integer types definitions                                                                *
 *                                                                                              *
 ************************************************************************************************/

typedef unsigned char   OST_UINT8;
typedef unsigned int    OST_UINT16;
typedef unsigned long   OST_UINT32;
typedef unsigned int    OST_BOOL;

typedef OST_UINT16    OST_UINT;
#define _OST_INT_MASK    15
#define _OST_INT_SHIFT   4
#define _OST_INT_SIZE    16


/************************************************************************************************
 *                                                                                              *
 *     Location keywords                                                                        *
 *                                                                                              *
 ************************************************************************************************/

#define OS_RAM_NEAR     __attribute__((near))
#define OS_RAM_BANK0
#define OS_RAM_BANK1
#define OS_RAM_BANK2
#define OS_RAM_BANK3

#define OST_BOOL             OST_UINT

#define _OS_CUR_FLAGS_IN_OS_STATE   // Work with tasks state througth _OS_State variable



/************************************************************************************************
 *                                                                                              *
 *     Processor specified definitions for system flags                                         *
 *     (see OST_SYSTEM_FLAGS and OST_TCB definition in file "OSA.h")                            *
 *                                                                                              *
 ************************************************************************************************/

#define _OS_SYSTEM_FLAGS_PROC_SPEC()                                                            \
                                                                                                \
        /*5..7*/OST_UINT   cIPL_Temp   : 3; /* Saved InterruptPriotityLevel    */               \
                                            /* when entering critical section  */               \
                                                                                                \
        /*8*/   OST_UINT   bTimeout    : 1; /* Event waiting timeout           */               \
                                                                                                \
        /*------------------------------------------------------*/                              \
        /*  Tells that task was replaced (with OS_Task_Replace) */                              \
        /*  so we don't need to save stack pointer for MCC30    */                              \
        /*------------------------------------------------------*/                              \
                                                                                                \
        /*9*/   OST_UINT   bTaskReplaced                   : 1;                                 \
                                                                                                \
         /*-----------------------------------------------------*/                              \
         /* Theese 5 bit variables contains information         */                              \
         /* about enablity "lnk" instruction in the             */                              \
         /* begin of 5 switching context routines.              */                              \
         /*-----------------------------------------------------*/                              \
                                                                                                \
                                                                                                \
        /*10*/  OST_UINT   bOSRetPoint_LNK                 : 1;                                 \
        /*11*/  OST_UINT   bOSRetPointNoSave_LNK           : 1;                                 \
        /*12*/  OST_UINT   bOSClearReady_LNK               : 1;                                 \
        /*13*/  OST_UINT   bOSClearReadySetCanContinue_LNK : 1;                                 \
        /*14*/  OST_UINT   bOSCheckEvent_LNK               : 1;                                 \


#define _OS_TCB_PROC_SPEC()                                                                     \
                                                                                                \
        OST_UINT16    W8_Temp;                                                                  \
        OST_UINT16    W9_Temp;                                                                  \
        OST_UINT16    W10_Temp;                                                                 \
        OST_UINT16    W11_Temp;                                                                 \
        OST_UINT16    W12_Temp;                                                                 \
        OST_UINT16    W13_Temp;                                                                 \
        OST_UINT16    W14_Temp;                                                                 \
        OST_UINT16    W15_Temp;                                                                 \


/************************************************************************************************
 *                                                                                              *
 *     Constants and types                                                                      *
 *                                                                                              *
 ************************************************************************************************/


#ifndef OS_SMSG_SIZE
#define OS_SMSG_SIZE    0   // We can not use sizeof() because it does not
                            // work with #ifdef directive
#endif

//------------------------------------------------------------------------------
// For all memory models pointer to code mast be 16-bit value (manual 5.6)
// (For model large used segment .handles)

typedef unsigned int                OST_CODE_POINTER;
#define OS_CODE_POINTER_SIZE        2


