giljr/Ardu_Serie/_37_Osa/_37_code/code/osa/port/pic24/osa_pic24_mplabc.h
#define __OSA_C30_24BIT__


#if defined __OSA_C30_24BIT__
#define OSA_TASK_STATE_PROC_SPEC()   OST_UINT8     pTaskPointerH;
#endif



/************************************************************************************************
 *                                                                                              *
 *     Platform macros                                                                          *
 *                                                                                              *
 ************************************************************************************************/


#define _OS_SET_TASK_IRP()      // Empty macro for this type of PICs
#define OS_CLRWDT()   asm volatile(" clrwdt     ")
#define OS_ClrWdt()   asm volatile(" clrwdt     ")
#define OS_SLEEP()    asm volatile(" pwrsav #0  ")
#define OS_Sleep()    asm volatile(" pwrsav #0  ")
#define OS_IDLE()     asm volatile(" pwrsav #1  ")
#define OS_Idle()     asm volatile(" pwrsav #1  ")






/************************************************************************************************
 *                                                                                              *
 *     S C H E D U L E R                                                                        *
 *                                                                                              *
 ************************************************************************************************/


//------------------------------------------------------------------------------
#if (OS_PRIORITY_LEVEL == OS_PRIORITY_DISABLED) || (OS_PRIORITY_LEVEL == OS_PRIORITY_NORMAL)
//------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    #ifdef OS_ENABLE_CRITICAL_SECTION
    //------------------------------------------------------------------------------
    
        #define _OS_SCHED_SKIP_IF_CRITICAL_SECTION()                                \
            asm volatile("   btsc    __OS_Flags, #2  ");                            \
            asm volatile("   bra     2f             "); /*  SCHED_CHECK_ENABLE   */ \
    
        #define IF_IN_CRITICAL_SECTION_THEN_BREAK()                                 \
            asm volatile("   btsc    __OS_Flags, #2  ");                            \
            asm volatile("   bra     6f             "); /*  SCHED_BREAK */          \
    
    //------------------------------------------------------------------------------
    #else
    //------------------------------------------------------------------------------
    
        #define _OS_SCHED_SKIP_IF_CRITICAL_SECTION()
        #define IF_IN_CRITICAL_SECTION_THEN_BREAK()
    
    //------------------------------------------------------------------------------
    #endif  // OS_ENABLE_CRITICAL_SECTION
    //------------------------------------------------------------------------------
    
    
    
    
    //------------------------------------------------------------------------------
    #ifdef OS_ENABLE_TTIMERS
    //------------------------------------------------------------------------------
    
        #define _OS_SCHED_IF_DELAIED_GOTO_CONTINUE()                                        \
            asm volatile("   btss    __OS_State, #4         "); /*  bDelay          */      \
            asm volatile("   bra     $ + 6                  "); /*  SCHED_NO_DELAY  */      \
            asm volatile("   btss    __OS_State, #5         "); /* bCanContinue */          \
            asm volatile("   bra     5f   ;SCHED_CONTINUE   ");                             \
            asm volatile(";SCHED_NO_DELAY:                  ");                             \
    
    //------------------------------------------------------------------------------
    #else
    //------------------------------------------------------------------------------
    
        #define _OS_SCHED_IF_DELAIED_GOTO_CONTINUE()
    
    //------------------------------------------------------------------------------
    #endif
    //------------------------------------------------------------------------------

//------------------------------------------------------------------------------
#endif  // PRIORITY_NORMAL || PRIORITY_DISABLED
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
#if OS_PRIORITY_LEVEL == OS_PRIORITY_NORMAL
//------------------------------------------------------------------------------

    /********************************************************************************************
     *                                                                                          *
     *     P R I O R I T Y   M O D E   S C H E D U L E R                                        *
     *                                                                                          *
     ********************************************************************************************/

    // This macro is to determine were there any ready task or system is in idle state
    #define OS_IsIdle()     (!OS_IsInCriticalSection() && !_OS_Flags.bBestTaskFound)

    #define OS_Sched()                                                                          \
    {                                                                                           \
        asm volatile("   bset    __OS_Flags, #3                     ");  /* bCheckingTasks */   \
        asm volatile("   bclr    __OS_Flags, #4                     ");  /* bBestTaskFound */   \
        asm volatile("   mov     #%0, w0"::"i"(OS_WORST_PRIORITY + 1));                         \
        asm volatile("   mov     w0, __OS_Best_Priority             ");                         \
                        _OS_SCHED_SKIP_IF_CRITICAL_SECTION();                                   \
        asm volatile("   mov     __OS_LastTask, w0                  ");                         \
        asm volatile("   mov     w0, __OS_CurTask                   ");                         \
        asm volatile("                                              ");                         \
        asm volatile("1:;SCHED_REPEAT:                              ");                         \
        asm volatile("   mov     #%0, w0"::"i"(_OS_Tasks));                                     \
        asm volatile("   add     #%0, w0"::"i"((OS_TASKS-1)*sizeof(OST_TCB)));                  \
        asm volatile("   cp      __OS_CurTask                       ");                         \
        asm volatile("   bra     nc, $ + 8                          "); /* SCHED_INC_CUR_TASK */\
        asm volatile("   mov     #%0, w0"::"i"(_OS_Tasks)            );                         \
        asm volatile("   mov w0, __OS_CurTask                       ");                         \
        asm volatile("   bra     2f    ;SCHED_CHECK_ENABLE          ");                         \
        asm volatile(";SCHED_INC_CUR_TASK:                          ");                         \
        asm volatile("   mov     #%0, w0"::"i"(sizeof(OST_TCB)));                               \
        asm volatile("   add     __OS_CurTask                       ");                         \
        asm volatile("                                              ");                         \
        asm volatile("2:;SCHED_CHECK_ENABLE:                        ");                         \
        asm volatile("   mov     __OS_CurTask, w1                   ");                         \
        asm volatile("   mov     [w1], w0                           ");                         \
        asm volatile("   mov     w0, __OS_State                     ");                         \
        asm volatile("   btsc    __OS_State, #6                     ");  /* bEnable */          \
        asm volatile("   btsc    __OS_State, #7                     ");  /* bPaused */          \
        asm volatile("   bra     5f   ;SCHED_CONTINUE               ");                         \
        asm volatile("                                              ");                         \
        asm volatile("   and     #7, w0                             ");                         \
        asm volatile("   cp      __OS_Best_Priority                 ");                         \
        asm volatile("   bra     leu, 5f  ;SCHED_CONTINUE           ");                         \
        asm volatile("                                              ");                         \
        asm volatile("   btsc    __OS_State, #3                     ");  /* bReady */           \
        asm volatile("   bra     4f    ;SCHED_SKIP_RUN              ");                         \
        asm volatile("3:;_OS_SCHED_RUN:                             ");                         \
                        _OS_JUMP_TO_TASK();                                                     \
                        _OS_BACK_TO_SCEDULER();                                                 \
        asm volatile("   btss    __OS_Flags, #3                     ");  /* bCheckingTasks */   \
        asm volatile("   bra     7f ;SCHED_END                      ");                         \
        asm volatile("                                              ");                         \
        asm volatile("4:;SCHED_SKIP_RUN:                            ");                         \
                        _OS_SCHED_IF_DELAIED_GOTO_CONTINUE();                                   \
        asm volatile("   btss    __OS_State, #3                     ");  /* bReady */           \
        asm volatile("   bra     5f   ;SCHED_CONTINUE               ");                         \
        asm volatile("   bset    __OS_Flags, #4                     ");  /* bBestTaskFound */   \
        asm volatile("   mov     __OS_CurTask, w0                   ");                         \
        asm volatile("   mov     w0, __OS_BestTask                  ");                         \
        asm volatile("   mov     [w0], w1                           ");                         \
        asm volatile("   and     #7, w1                             ");                         \
        asm volatile("   mov     w1, __OS_Best_Priority             ");                         \
        asm volatile("   bra     z, 6f  ;SCHED_BREAK                ");                         \
        asm volatile("                                              ");                         \
        asm volatile("5:;SCHED_CONTINUE:                            ");                         \
                        IF_IN_CRITICAL_SECTION_THEN_BREAK();                                    \
        asm volatile("   mov     __OS_CurTask, w0                   ");                         \
        asm volatile("   cp      __OS_LastTask                      ");                         \
        asm volatile("   bra     nz, 1b ;SCHED_REPEAT               ");                         \
        asm volatile("                                              ");                         \
        asm volatile("6:;SCHED_BREAK:                               ");                         \
        asm volatile("   btss    __OS_Flags, #4                     ");  /* bBestTaskFound */   \
        asm volatile("   bra     7f ;SCHED_END                      ");                         \
        asm volatile("   bclr    __OS_Flags, #3                     ");  /* bCheckingTasks */   \
        asm volatile("   mov     __OS_BestTask, w0                  ");                         \
        asm volatile("   mov     w0, __OS_CurTask                   ");                         \
        asm volatile("   mov     w0, __OS_LastTask                  ");                         \
        asm volatile("   bra     3b    ;_OS_SCHED_RUN               ");                         \
                                                                                                \
        asm volatile("7:    ;SCHED_END:                             ");                         \
    }

//------------------------------------------------------------------------------
#endif   // OS_PRIORITY_NORMAL
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
#if OS_PRIORITY_LEVEL == OS_PRIORITY_EXTENDED
//------------------------------------------------------------------------------

/**** The OS_Sched for EXTENDED mode is defined in osa_system.h ****/

//------------------------------------------------------------------------------
#endif
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
#if OS_PRIORITY_LEVEL == OS_PRIORITY_DISABLED
//------------------------------------------------------------------------------

    /********************************************************************************************
     *                                                                                          *
     *     N O N   P R I O R I T Y   M O D E   S C H E D U L E R                                *
     *                                                                                          *
     ********************************************************************************************/

    #define OS_IsIdle()     0    // for non priority mode supposed that system always not in idle

    // Scheduler macro for NON PRIORITY MODE

    #define OS_Sched()                                                                          \
    {                                                                                           \
        asm volatile("   clr     __OS_Temp                          ");                         \
                        _OS_SCHED_SKIP_IF_CRITICAL_SECTION();                                   \
        asm volatile("   mov     #%0, w0"::"i"(_OS_Tasks));                                     \
        asm volatile("   add     #%0, w0"::"i"((OS_TASKS-1)*sizeof(OST_TCB)));                  \
        asm volatile("   cp      __OS_CurTask                       ");                         \
        asm volatile("   bra     nc, $ + 8                          "); /* SCHED_INC_CUR_TASK */\
        asm volatile("   mov     #%0, w0"::"i"(_OS_Tasks));                                     \
        asm volatile("   mov     w0, __OS_CurTask                   ");                         \
        asm volatile("   bra     2f    ;SCHED_CHECK_ENABLE          ");                         \
        asm volatile(";SCHED_INC_CUR_TASK:                          ");                         \
        asm volatile("   mov     #%0, w0"::"i"(sizeof(OST_TCB)));                               \
        asm volatile("   add     __OS_CurTask                       ");                         \
        asm volatile("                                              ");                         \
        asm volatile("2:;SCHED_CHECK_ENABLE:                        ");                         \
        asm volatile("   mov     __OS_CurTask, w1                   ");                         \
        asm volatile("   mov     [w1], w0                           ");                         \
        asm volatile("   mov     w0, __OS_State                      ");                        \
        asm volatile("   btsc    __OS_State, #6                      "); /* bEnable */          \
        asm volatile("   btsc    __OS_State, #7                      "); /* bPaused */          \
        asm volatile("   bra     5f   ;SCHED_CONTINUE               ");                         \
                        _OS_SCHED_IF_DELAIED_GOTO_CONTINUE();                                   \
                        _OS_JUMP_TO_TASK();                                                     \
                        _OS_BACK_TO_SCEDULER();                                                 \
        asm volatile("5:;SCHED_CONTINUE                             ");                         \
    }



//------------------------------------------------------------------------------
#endif  // OS_PRIORITY_DISABLED
//------------------------------------------------------------------------------

//______________________________________________________________________________





/************************************************************************************************
 *                                                                                              *
 *     Context switching macros                                                                 *
 *                                                                                              *
 ************************************************************************************************/

