giljr/Ardu_Serie/_37_Osa/_37_code/code/osa/port/pic24/osa_pic24_mplabc.h
    #define __OS_StimersWorkSize()                                  \
        asm volatile("  mov     #__OS_Stimers, w0             ");     \
        asm volatile("  mov     #%0, w1"::"i"(OS_STIMERS*1)  );     \
        asm volatile("  add     w0,w1,w1                    ");     \
        asm volatile("0:                                    ");     \
        asm volatile("  mov.b   [w0++], w2                  ");     \
        asm volatile("  btsc    w2, #7                      ");     \
        asm volatile("  inc.b   [--w0], [w0++]              ");     \
        asm volatile("  cp      w0,w1                       ");     \
        asm volatile("  bra     nz, 0b                      ");     \


//------------------------------------------------------------------------------
#elif   OS_STIMER_SIZE == 2
//------------------------------------------------------------------------------

    #define __OS_StimerWork(STIMER_ID)                                              \
        {                                                                           \
            asm volatile("  btsc       __OS_Stimers + %0,#15"::"i"(STIMER_ID*2));   \
            asm volatile("  inc        __OS_Stimers + %0    "::"i"(STIMER_ID*2));   \
        }


    #define __OS_StimersWorkSize()                                  \
        asm volatile("  mov     #__OS_Stimers, w0             ");     \
        asm volatile("  mov     #%0, w1"::"i"(OS_STIMERS*2)  );     \
        asm volatile("  add     w0,w1,w1                    ");     \
        asm volatile("0:                                    ");     \
        asm volatile("  btsc    [w0++], #15                 ");     \
        asm volatile("  inc     [--w0], [w0++]              ");     \
        asm volatile("  cp      w0,w1                       ");     \
        asm volatile("  bra     nz, 0b                      ");     \


//------------------------------------------------------------------------------
#elif   OS_STIMER_SIZE == 4
//------------------------------------------------------------------------------

    #define __OS_StimerWork(STIMER_ID)                                              \
        {                                                                           \
            asm volatile("  btss       __OS_Stimers + %0,#15"::"i"(STIMER_ID*4+2)); \
            asm volatile("  bra        0f                                       "); \
            asm volatile("  inc        __OS_Stimers + %0    "::"i"(STIMER_ID*4));   \
            asm volatile("  bra        nc, 0f                                   "); \
            asm volatile("  inc        __OS_Stimers + %0    "::"i"(STIMER_ID*4+2)); \
            asm volatile("0:                                                    "); \
        }


    #define __OS_StimersWorkSize()                                  \
        asm volatile("  mov     #__OS_Stimers, w0             ");     \
        asm volatile("  mov     #%0, w1"::"i"(OS_STIMERS*4)  );     \
        asm volatile("  add     w0,w1,w1                    ");     \
        asm volatile("0:                                    ");     \
        asm volatile("  btss    [++w0], #15                 ");     \
        asm volatile("  bra     1f                          ");     \
        asm volatile("  inc     [--w0], [w0++]              ");     \
        asm volatile("  bra     nc, 1f                      ");     \
        asm volatile("  inc     [w0],[w0]                   ");     \
        asm volatile("1:                                    ");     \
        asm volatile("  inc2    w0, w0                      ");     \
        asm volatile("  cp      w0,w1                       ");     \
        asm volatile("  bra     nz, 0b                      ");     \


//------------------------------------------------------------------------------
#endif  // OS_STIMER_SIZE
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
#endif  // OS_ENABLE_STIMERS
//------------------------------------------------------------------------------












/******************************************************************************************
 *
 *  WORK WITH TASK TIMERS
 *
 ******************************************************************************************/
//------------------------------------------------------------------------------
#ifdef  OS_ENABLE_TTIMERS
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
#if   OS_TTIMER_SIZE == 1
//------------------------------------------------------------------------------

    #define __OS_TtimerWork(TASK_ID)                                                \
        asm volatile("  btss    __OS_Tasks + %0, #4"::"i"(22 * TASK_ID));           \
        asm volatile("  bra     0f                                      ");         \
        asm volatile("  inc.b   __OS_Tasks + %0"::"i"(22 * TASK_ID+20) );           \
        asm volatile("  bra     nc, 0f                                  ");         \
        asm volatile("  bclr    __OS_Tasks + %0, #4"::"i"(22 * TASK_ID));           \
        asm volatile("0:                                                ");         \

    #define __OS_TtimersWorkSize()                                                  \
        asm volatile("  mov     #__OS_Tasks, w0           ");                       \
        asm volatile("  mov     #%0, w1"::"i"(OS_TASKS*22)   );                     \
        asm volatile("  add     w0,w1,w1                    ");                     \
        asm volatile("0:                                    ");                     \
        asm volatile("  btss    [w0], #4                    ");                     \
        asm volatile("  bra     1f                          ");                     \
        asm volatile("  add     w0,#20,w2                   ");                     \
        asm volatile("  inc.b   [w2], [w2++]                ");                     \
        asm volatile("  bra     nc, 1f                      ");                     \
        asm volatile("  bclr    [w0], #4                    ");                     \
        asm volatile("1:                                    ");                     \
        asm volatile("  add     w0, #22, w0                 ");                     \
        asm volatile("  cp      w0,w1                       ");                     \
        asm volatile("  bra     nz, 0b                      ");                     \


//------------------------------------------------------------------------------
#elif OS_TTIMER_SIZE == 2
//------------------------------------------------------------------------------

    #define __OS_TtimerWork(TASK_ID)                                                \
        asm volatile("  btss    __OS_Tasks + %0, #4"::"i"(22 * TASK_ID));           \
        asm volatile("  bra     0f                                      ");         \
        asm volatile("  inc     __OS_Tasks + %0"::"i"(22 * TASK_ID+20) );           \
        asm volatile("  bra     nc, 0f                                  ");         \
        asm volatile("  bclr    __OS_Tasks + %0, #4"::"i"(22 * TASK_ID));           \
        asm volatile("0:                                                ");         \

    #define __OS_TtimersWorkSize()                                                  \
        asm volatile("  mov     #__OS_Tasks, w0           ");                       \
        asm volatile("  mov     #%0, w1"::"i"(OS_TASKS*22)   );                     \
        asm volatile("  add     w0,w1,w1                    ");                     \
        asm volatile("0:                                    ");                     \
        asm volatile("  btss    [w0], #4                    ");                     \
        asm volatile("  bra     1f                          ");                     \
        asm volatile("  add     w0,#20,w2                   ");                     \
        asm volatile("  inc     [w2], [w2++]                ");                     \
        asm volatile("  bra     nc, 1f                      ");                     \
        asm volatile("  bclr    [w0], #4                    ");                     \
        asm volatile("1:                                    ");                     \
        asm volatile("  add     w0, #22, w0                 ");                     \
        asm volatile("  cp      w0,w1                       ");                     \
        asm volatile("  bra     nz, 0b                      ");                     \



//------------------------------------------------------------------------------
#elif OS_TTIMER_SIZE == 4
//------------------------------------------------------------------------------

    #define __OS_TtimerWork(TASK_ID)                                                \
        asm volatile("  btss    __OS_Tasks + %0, #4"::"i"(24 * TASK_ID));           \
        asm volatile("  bra     0f                                      ");         \
        asm volatile("  inc     __OS_Tasks + %0"::"i"(24 * TASK_ID+20)    );        \
        asm volatile("  bra     nc, 0f                                  ");         \
        asm volatile("  inc     __OS_Tasks + %0"::"i"(24 * TASK_ID+22)    );        \
        asm volatile("  bra     nc, 0f                                  ");         \
        asm volatile("  bclr    __OS_Tasks + %0, #4"::"i"(24 * TASK_ID));           \
        asm volatile("0:                                                ");         \


    #define __OS_TtimersWorkSize()                                                  \
        asm volatile("  mov     #__OS_Tasks, w0           ");                       \
        asm volatile("  mov     #%0, w1"::"i"(OS_TASKS*24)   );                     \
        asm volatile("  add     w0,w1,w1                    ");                     \
        asm volatile("0:                                    ");                     \
        asm volatile("  btss    [w0], #4                    ");                     \
        asm volatile("  bra     1f                          ");                     \
        asm volatile("  add     w0,#20,w2                   ");                     \
        asm volatile("  inc     [w2], [w2++]                ");                     \
        asm volatile("  bra     nc, 1f                      ");                     \
        asm volatile("  inc     [w2], [w2++]                ");                     \
        asm volatile("  bra     nc, 1f                      ");                     \
        asm volatile("  bclr    [w0], #4                    ");                     \
        asm volatile("1:                                    ");                     \
        asm volatile("  add     w0, #24, w0                 ");                     \
        asm volatile("  cp      w0,w1                       ");                     \
        asm volatile("  bra     nz, 0b                      ");                     \


//------------------------------------------------------------------------------
#endif      // if sizeof(OS_TIMER_TYPE)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
#endif      // OS_ENABLE_TTIMERS
//------------------------------------------------------------------------------






//______________________________________________________________________________
/******************************************************************************************
 *
 * MACROS FOR OLD STYLE STATIC TIMERS WORK
 *
 ******************************************************************************************/

//------------------------------------------------------------------------------

#define __OS_Timer8Work(TIMER_ID,L)                                                                                     \
{                                                                                                                       \
    asm volatile("   btss   _OS_Timeouts + #%0, #%1"::"i"((TIMER_ID >> _OST_INT_SHIFT)),"i"(TIMER_ID & _OST_INT_MASK)); \
    asm volatile("   bra    $ + #12 ");                                                                                 \
    asm volatile("   mov.b    _OS_Timers8+%0, wreg"::"i"(TIMER_ID));                                                    \
    asm volatile("   inc.b    w0, w0     ");                                                                            \
    asm volatile("   mov.b    wreg, _OS_Timers8+%0"::"i"(TIMER_ID));                                                    \
    asm volatile("   bra    NZ, $ + #4");                                                                               \
    asm volatile("   bclr   _OS_Timeouts + #%0, #%1"::"i"((TIMER_ID >> _OST_INT_SHIFT)),"i"(TIMER_ID & _OST_INT_MASK)); \
}

//------------------------------------------------------------------------------

#define __OS_Timer16Work(TIMER_ID,L)                                                                                \
{                                                                                                               \
    asm volatile("   btss   _OS_Timeouts + #%0, #%1"::"i"(((TIMER_ID+_OS_TIMER16_POS) >> _OST_INT_SHIFT)),"i"((TIMER_ID+_OS_TIMER16_POS) & _OST_INT_MASK));    \
    asm volatile("   bra    $ + #12 ");                                                                                   \
    asm volatile("   mov    _OS_Timers16+%0, w0"::"i"((TIMER_ID)*2));                                                    \
    asm volatile("   inc    w0, w0     ");                                                                               \
    asm volatile("   mov    w0, _OS_Timers16+%0"::"i"((TIMER_ID)*2));                                                    \
    asm volatile("   bra    NZ, $ + #4");                                                                                \
    asm volatile("   bclr   _OS_Timeouts + #%0, #%1"::"i"(((TIMER_ID+_OS_TIMER16_POS) >> _OST_INT_SHIFT)),"i"((TIMER_ID+_OS_TIMER16_POS) & _OST_INT_MASK));      \
}

//------------------------------------------------------------------------------

